tap "adoptopenjdk/openjdk"
tap "homebrew/cask-fonts"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "wix/brew"

cask_args appdir: "/Applications"


brew "fzf"
brew "direnv"
brew "git"
brew "mas"
brew "moreutils"
brew "chruby"
brew "neovim"
brew "nvm"
brew "python"
brew "pyenv"
brew "rename"
brew "ruby-install"
brew "screen"
brew "starship"
brew "stow"
brew "vim"
brew "yarn"
brew "zsh"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"

cask "1password"
cask "iterm2"
cask "alfred"
cask "firefox"
cask "dropbox"
cask "google-chrome"
cask "spotify"
cask "the-unarchiver"
cask "transmission"
cask "font-fira-code"
cask "visual-studio-code"
cask "microsoft-teams"
cask "zoom"
cask "coconutbattery"
cask "whatsapp"
cask "calibre"
cask "messenger"
cask "notion"
cask "brave-browser"
cask "rectangle"
cask "itsycal"
cask "topnotch"
cask "4k-video-downloader"
cask "guitar-pro"
cask "vlc"