tap "adoptopenjdk/openjdk"
tap "homebrew/cask-fonts"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "wix/brew"

cask_args appdir: "/Applications"


brew "fzf"
brew "git"
brew "mas"
brew "moreutils"
brew "neovim"
brew "node"
brew "python"
brew "pyenv"
brew "rename"
brew "ruby-install"
brew "screen"
brew "starship"
brew "stow"
brew "vim"
brew "yarn"
brew "zsh"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"

cask "1password"
cask "iterm2"
cask "alfred"
cask "firefox"
cask "flux"
cask "font-hack"
cask "font-hack-nerd-font"
cask "google-chrome"
cask "spotify"
cask "the-unarchiver"
cask "transmission"
cask "ultimaker-cura"
cask "visual-studio-code"
cask "zoom"
